feat: edited read me
